#include <stdio.h>
//จงเขียนโปรแกรมรับตัวเลข 1 ตัวแล้วให้คอมพิวเตอร์วาดรูปเครื่องหมาย * เป็นสามเหลี่ยมที่มีด้านเท่ากับตัวเลขที่รับเข้ามา ดังตัวอย่าง (Level 2)
int main()
{
    //  y = แถว p = ดอกจัน
    int x, y = 1, p = 1;
    scanf("%d", &x);
    printf("");
    while (1)
    {
        printf("*");
        if (y == p)
        {
            printf("\n");
            y++; p=1;
        }
        else
        {
            p++;
        }
    if (y > x)
    {
        break;
    }
    }
    
    return 0;
}
/*
*
**
***
****
*****
******
*/